#+TITLE:Formatted I/O: printf and scanf
#+AUTHOR:Marcus Birkenkrahe
#+Source: KN King C Programming
#+SUBTITLE:CSC 100 Introduction to programming in C/C++, Summer 2022
#+STARTUP: overview hideblocks indent
#+OPTIONS: toc:1 num:1 ^:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h>
#+PROPERTY: header-args:C :exports both :comments both
* Examples:

#+name: mpx
#+begin_src C :results output
  printf("....|....|....|\n");
  printf("%8d\n", 123); // print 123 on 8 places (right-aligned)
  printf("%-8d\n", 123); // print 123 on 8 places (left-aligned)
  printf("%10.3f\n", 3.141593); // print 3 decimals on 10 places (right)
  printf("%-10.3f\n", 3.141593); // print 3 decimals on 10 places (left)
#+end_src

#+RESULTS: mpx
: ....|....|....|
:      123
: 123
:      3.142
: 3.142

* Integer decimal "d"

- ~d~ displays an integer in decimal (= base 10) form. ~p~ is the minimum
  number of digits to display the integer. Default is ~p=1~.

- For example, the code below [[spec]] prints numbers with different
  precision values:
  - ~%d~ displays ~int~ in decimal form (minimum amount of space)
  - ~%5d~ displays ~int~ in decimal form using 5 characters
  - ~%-5d~ displays ~int~ on 5 characters, left-justified
  - ~%5.3d~ displays ~int~ on 5 characters, at least 3 digits

  #+name: spec
  #+begin_src C :results output
    int i = 40;
    printf("....|....|\n");
    printf("%d\n",i); // decimal form (minimum amount of space)
    printf("%5d\n",i); // decimal form using 5 characters
    printf("%-5d\n",i); // on 5 characters, left-justified
    printf("%5.4d\n",i); // on 5 characters, at least 3 digits
  #+end_src

  #+RESULTS: spec
  : ....|....|
  : 40
  :    40
  : 40
  :  0040

* Floating point exponential "e"

- ~e~ displays a floating-point number in exponential ("scientific")
  notation, e.g. ~10. * 10. * 10. = 1000. = 1.0e+03~.

- ~p~ indicates the digits after decimal point. If ~p=0~, no decimal point
  is displayed.

What went wrong in the first two statements?

#+begin_src C :results output
  printf("....|....|....|\n");
  printf("%.e\n", 1.);  // the 1 must be a floating-point value
  printf("%100.3e\n", 1000.);
  printf("%e\n", 1000000000000000.);
  printf("%15.e\n", 1000000000000000.);
#+end_src

#+RESULTS:
: ....|....|....|
: 1e+000
:                                                                                           1.000e+003
: 1.000000e+015
:          1e+015

* Floating point fixed decimal "f"

That's ~f~ as we already know it from many other examples. The
precision p is defined as for ~e~. Trailing zeroes are shown.

#+name: floatexample
#+begin_src C :results output
  printf("....|....|\n");
  printf("%10.3f\n", 100.1);
#+end_src

#+RESULTS: floatexample
: ....|....|
:    100.100

* Variable floating point "g"

- ~g~ displays a floating point number in either exponential format or
  fixed decimal format depending on the number's size.
- ~p~ is the maximum number of *significant* digits (*not* digits after the
  decimal point!) to be displayed.
- No trailing zeroes are shown. If there are no decimal digits after
  the decimal point, no decimal point is shown.

#+name: gfactor :results output
#+begin_src C :results output
  printf("%g\n%g\n%g\n", 299792458., 1.45e+03, 8000);
#+end_src

#+RESULTS: gfactor :results output
: 2.99792e+008
: 1450
: 1.42174e-312

* First example

- Example input:
  #+begin_example
  1  -20  .3   -4.0e3
  #+end_example

  Example program to read this input:
  #+name: pgm:tscanf
  #+begin_src C :cmdline < ./data/io_scanf_input :results output
    int i, j;
    float x, y;

    scanf("%d%d%f%f", &i, &j, &x, &y);

    printf("|%5d|%5d|%5.1f|%10.1f|\n", i, j, x, y);
  #+end_src

  #+RESULTS: pgm:tscanf
  : |    1|  -20|  0.3|   -4000.0|

  Create the input file:
  #+name: pgm:io_scanf_input
  #+begin_src bash :results silent
    echo "1  -20 .3 -4.0e+3" > ./data/io_scanf_input
  #+end_src

